@echo OFF
chcp 65001
setlocal enabledelayedexpansion
::фикс для и от Сани
SET HOSTS_FILE=%WINDIR%\System32\drivers\etc\hosts 


:: GREEN FN REFERENCE?!?!?!?!??!??!?!?!??
net session >nul 2>&1
if %errorLevel% neq 0 (
echo               -. .
echo        _____   ',' ,
echo      ,'     ,'   ', ',
echo    ,'     ,'      \  /
echo   \       \       /  \
echo     \ /^\   \    ,' ,'
echo           \   \ ,' ,'
echo     / ~-.___\.-'  ,'
echo   /   .______.- ~ \
echo /   /'          \   \
echo \./               \/'
:: САЮЮЮЮЮЮЮЗ
echo ДАЁЖ АДМИН ПРАВА РАБОЧЕМУ НАРОДУ

echo ---------------------------------
echo включи скрипт с админ правами
)
:: Палитра
:: echo [92m Сильный Зелёный [0m
:: echo [32m Нормальный Зелё [0m
:: echo [32m Тёмно-Зелёный   [0m
:: Жёстко. Разъёб.
::                         __                                                       
::                        |  \                                                      
:: ______ ____    ______   \$$ _______   ______ ____    ______   _______   __    __ 
::|      \    \  |      \ |  \|       \ |      \    \  /      \ |       \ |  \  |  \
::| $$$$$$\$$$$\  \$$$$$$\| $$| $$$$$$$\| $$$$$$\$$$$\|  $$$$$$\| $$$$$$$\| $$  | $$
::| $$ | $$ | $$ /      $$| $$| $$  | $$| $$ | $$ | $$| $$    $$| $$  | $$| $$  | $$
::| $$ | $$ | $$|  $$$$$$$| $$| $$  | $$| $$ | $$ | $$| $$$$$$$$| $$  | $$| $$__/ $$
::| $$ | $$ | $$ \$$    $$| $$| $$  | $$| $$ | $$ | $$ \$$     \| $$  | $$ \$$    $$
:: \$$  \$$  \$$  \$$$$$$$ \$$ \$$   \$$ \$$  \$$  \$$  \$$$$$$$ \$$   \$$  \$$$$$$     [1m Bold [0m
:menu
mode con: cols=100 lines=30
color 2
mode con: cols=100 lines=30
title UEBOKv0.2 WINDOWS
cls
echo [1m[38;2;12;50;0m ﾘ         бай лэпчик  ｸ      ｸ          ｼ   ﾐ        ﾋ          日                   ﾋ            ｸ[0m 
echo [1m[38;2;12;80;0m ﾐ    ﾕ ﾓ         ﾊ               ﾅ                ﾘ                          ﾐ                         [0m 
echo [1m[38;2;12;110;0m  ﾊ       ｼ      ｸ         [0m[92m ██╗   ██╗███████╗██████╗  ██████╗ ██╗  ██╗ [0m [38;2;12;110;0m    ﾘ     ﾋ               ｼ[0m
echo [1m[38;2;12;140;0m ｸ            ﾋ          ﾊ  [0m[92m██║   ██║██╔════╝██╔══██╗██╔═══██╗██║ ██╔╝ [0m  [38;2;12;140;0m                ﾐ        [0m
echo [1m[38;2;12;170;0m      ﾐ     ｸ               [0m[92m██║   ██║█████╗  ██████╔╝██║   ██║█████╔╝  [0m  [38;2;12;170;0m   ｳ                      [0m
echo [1m[38;2;12;200;0m                   ｸ        [0m[92m██║   ██║██╔══╝  ██╔══██╗██║   ██║██╔═██╗  [0m  [38;2;12;200;0m       ﾐ                 [0m
echo [1m[38;2;12;230;0m                            [0m[92m╚██████╔╝███████╗██████╔╝╚██████╔╝██║  ██╗ [0m  [38;2;12;230;0m               ﾓ         [0m
echo [1m[38;2;12;255;0m  ﾐ    ｸ         ﾊ          [0m[92m ╚═════╝ ╚══════╝╚═════╝  ╚═════╝ ╚═╝  ╚═╝ [0m  [38;2;12;255;0m     ﾋ                  ﾋ[0m
echo [1m[38;2;12;255;0m            ﾐ       ﾅ            ﾋ                              ﾊ                          ｼ             [0m
echo [1m[1m                ｼ       Ультимативный Эмулятор Базовых Операций в Консоли.[0m                     ｳ[0m
echo:
echo:

:: Запчасти трубы

::╚═╦═════»


echo ————————————————————————————————————————————————————————————————————————————————————————————————————
echo ══uebok════════════════╦══════════» [92m [1] Пробросить сервер EISSCHOOL [0m  
echo                        ╚╦═════════» [92m [2] Записать кастомный домен [0m  
echo                         ╚╦════════» [92m [3] Открыть hosts [0m  
echo                          ╚╦═══════» [92m [4] Пропинговать [0m  
echo                           ╚╦══════» [92m [5] Конфигурация сети [0m  
echo                            ╚╦═════» [92m [6] МРТ [0m  
echo                             ╚╦════» [92m [7] Производительность [0m  
echo                              ╚╦═══» [92m [8] netstat [0m  
echo                               ╚═══» [92m [E] Ехит [0m  
echo ————————————————————————————————————————————————————————————————————————————————————————————————————
::невидимый символ, осторожнее, не удали
set /p c=ㅤ                                Выбери команду (1-8,e):

if "%c%" == "1" goto aisserverhosts
if "%c%" == "2" goto custom_domain
if "%c%" == "3" goto OPEN_HOSTS
if "%c%" == "4" goto proping
if "%c%" == "5" goto ifcfg
if "%c%" == "6" goto mri
if "%c%" == "7" goto pwrmngr
if "%c%" == "8" goto ntstat
if "%c%" == "у" goto exit
if "%c%" == "e" (goto exit
)else goto MENU

echo:
pause
goto menu

:ntstat
cls
netstat
goto menu                                                                                          
::  ______    ______   __   __   __   ______    ______   ______ ____   _______    ______    ______  
:: /      \  /      \ |  \ |  \ |  \ /      \  /      \ |      \    \ |       \  /      \  /      \ 
::|  $$$$$$\|  $$$$$$\| $$ | $$ | $$|  $$$$$$\|  $$$$$$\| $$$$$$\$$$$\| $$$$$$$\|  $$$$$$\|  $$$$$$\
::| $$  | $$| $$  | $$| $$ | $$ | $$| $$    $$| $$   \$$| $$ | $$ | $$| $$  | $$| $$  | $$| $$   \$$
::| $$__/ $$| $$__/ $$| $$_/ $$_/ $$| $$$$$$$$| $$      | $$ | $$ | $$| $$  | $$| $$__| $$| $$      
::| $$    $$ \$$    $$ \$$   $$   $$ \$$     \| $$      | $$ | $$ | $$| $$  | $$ \$$    $$| $$      
::| $$$$$$$   \$$$$$$   \$$$$$\$$$$   \$$$$$$$ \$$       \$$  \$$  \$$ \$$   \$$ _\$$$$$$$ \$$      
::| $$                                                                          |  \__| $$          
::| $$                                                                           \$$    $$          
:: \$$                                                                            \$$$$$$           
::производительнее некуда
:pwrmngr
cls
echo:
echo                             .d888                                                                  
echo                             d88P"                                                                   
echo                             888                                                                     
echo   88888b.   .d88b.  888d888 888888 .d88b.  888d888 88888b.d88b.   8888b.  88888b.   .d8888b .d88b.  
echo   888 "88b d8P  Y8b 888P"   888   d88""88b 888P"   888 "888 "88b     "88b 888 "88b d88P"   d8P  Y8b 
echo   888  888 88888888 888     888   888  888 888     888  888  888 .d888888 888  888 888     88888888 
echo   888 d88P Y8b.     888     888   Y88..88P 888     888  888  888 888  888 888  888 Y88b.   Y8b.     
echo   88888P"   "Y8888  888     888    "Y88P"  888     888  888  888 "Y888888 888  888  "Y8888P "Y8888  
echo   888                                                                                               
echo   888                                                                                               
echo   888                                                                                               
echo:
echo ————————————————————————————————————————————————————————————————————————————————————————————————————
echo ══uebok════performance═╦══════════» [92m[1] Проверка драйверов [0m  
echo                        ╚╦═════════» [92m[2] Целостность файлов [0m  
echo                         ╚╦════════» [92m[3] Отчёт энергопотребления [0m  
echo                          ╚════╦═══» [92m[4] Отчёт о процессах, удерживающих сон ПК [0m  
echo                               ╚═══» [92m[E] Назад [0m  
echo ————————————————————————————————————————————————————————————————————————————————————————————————————

set /p ca=ㅤ                                Выбери команду (1-4,e):
if "%ca%" == "1" goto dr
if "%ca%" == "2" goto sf
if "%ca%" == "3" goto ene
if "%ca%" == "4" goto req
if "%ca%" == "у" goto menu
if "%ca%" == "e" (goto menu
)else goto pwrmngr

:req
cls
powercfg /requests
pause
goto menu


:ene
cls
powercfg /energy
pause
goto menu

:dr
cls
verifier
goto menu

:sf
cls
sfc /scannow
pause
goto menu

:ifcfg
cls
mode con: cols=100 lines=90
ipconfig
pause
goto menu

:mri
cls
mrt
pause
goto menu

::                      __                                        __       
::                     |  \                                      |  \      
:: _______    ______  _| $$_    __   __   __   ______    ______  | $$   __ 
::|       \  /      \|   $$ \  |  \ |  \ |  \ /      \  /      \ | $$  /  \
::| $$$$$$$\|  $$$$$$\\$$$$$$  | $$ | $$ | $$|  $$$$$$\|  $$$$$$\| $$_/  $$
::| $$  | $$| $$    $$ | $$ __ | $$ | $$ | $$| $$  | $$| $$   \$$| $$   $$ 
::| $$  | $$| $$$$$$$$ | $$|  \| $$_/ $$_/ $$| $$__/ $$| $$      | $$$$$$\ 
::| $$  | $$ \$$     \  \$$  $$ \$$   $$   $$ \$$    $$| $$      | $$  \$$\
:: \$$   \$$  \$$$$$$$   \$$$$   \$$$$$\$$$$   \$$$$$$  \$$       \$$   \$$
:proping
cls
echo:
echo:
echo:
echo                      [32m      ::::::::: ::::::::::: ::::    :::  ::::::::  [0m     
echo                      [32m      :+:    :+:    :+:     :+:+:   :+: :+:    :+: [0m        
echo                      [32m      +:+    +:+    +:+     :+:+:+  +:+ +:+        [0m     
echo                      [92m      +#++:++#+     +#+     +#+ +:+ +#+ :#:        [0m           
echo                      [92m      +#+           +#+     +#+  +#+#+# +#+   +#+# [0m          
echo                      [92m      #+#           #+#     #+#   #+#+# #+#    #+# [0m       
echo                      [92m      ###       ########### ###    ####  ########  [0m   
echo:
echo:
set /p cc=Введи адрес для пропинга (192.168.0.1) :
echo CTRL + C = Стоп
echo ————————————————————————————————————————————————————————————————————————————————————————————————————
ping -t %cc%


goto menu

:: Спасибо @EstviAL, легенде российского кода, отцу ебанутых идей
:AISSERVERHOSTS
SET HOSTS_FILE=%WINDIR%\System32\drivers\etc\hosts
ECHO -------- AISSERVERHOSTS WRITE @EstviAL -----------
SET  IP_ADDRESS=10.69.180.230:5000
SET  DOMAIN_NAME=eisschool41.sc41
FINDSTR /C:"%DOMAIN_NAME%" "%HOSTS_FILE%" > NUL
IF %ERRORLEVEL% NEQ 0 (
    echo: >> "%HOSTS_FILE%"
    ECHO %IP_ADDRESS% %DOMAIN_NAME% >> "%HOSTS_FILE%"
    color 4
    ECHO Успех средней успешности. Проверьте файл hosts. 
) ELSE (
    ECHO Успешный Успех. Теперь есть доступ к "%DOMAIN_NAME%".
)
PAUSE
GOTO MENU

:CUSTOM_DOMAIN

ECHO -------- Custom domain record. @EstviAL ----------------
SET /p IP_ADDRESS=Enter IP Address(Example:192.168.1.10):
SET /p DOMAIN_NAME=Enter DomainName(example:myflaskapp.local):
ECHO --------------------------------------------------------
FINDSTR /C:"%DOMAIN_NAME%" "%HOSTS_FILE%" > NUL
IF %ERRORLEVEL% NEQ 0 (
    ECHO %IP_ADDRESS% %DOMAIN_NAME% >> "%HOSTS_FILE%"
    @ECHO Успешный успех! (или нет?!?!?!)
) ELSE (
    ECHO Успешный успех!
)
PAUSE
GOTO MENU

:OPEN_HOSTS
echo Окей, открываем...
START "" "%SystemRoot%\System32\notepad.exe" "%HOSTS_FILE%"
GOTO MENU


:EXIT
ECHO Пока-пока...
ENDLOCAL
EXIT

pause